// 信用卡
var patten = /[0-9]{13,16}/
// 银联卡
var patten = /^62[0-5]\d{13,16}$/
// Visa
var patten = /^4[0-9]{12}(?:[0-9]{3})?$/
// 万事达
var patten = /^5[1-5][0-9]{14}$/
// QQ号码
var patten = /[1-9][0-9]{4,14}/
// 手机号码
var patten = /^(13[0-9]|14[5|7]|15[0-9]|18[0-9])\d{9}$/
// 身份证
var patten = /^([0-9]){7,18}(x|X)$/
// 密码
var patten = /^[a-zA-Z]\w{5,17}$/; // 字母开头，长度在 6~18 之间，只能包含字母、数字和下划线
// 强密码
var patten = /^(?=.*\d)(?=.*[A-Z]).{8,10}$/; // 包含大小写字母和数字的组合，不能使用特殊字符，长度在8-10之间
// 7个汉字或者14个字符
var patten = /^[\u4e00-\u9fa5]{1,7}$|^[\dA-Za-z_]{1,14}$/;